jupyter/experiments/sift/outputs/false_10k_K8.txt
pgbench (14.8 (Homebrew), server 15.3 (Debian 15.3-1.pgdg120+1))
transaction type: -
scaling factor: 1
query mode: simple
number of clients: 5
number of threads: 5
number of transactions per client: 15
number of transactions actually processed: 75/75
latency average = 2.924 ms
initial connection time = 12.384 ms
tps = 1710.181279 (without initial connection time)
statement latencies in milliseconds:
         0.003  \SET id random(1, 10000)
         2.680  SELECT *