jupyter/experiments/sift/outputs/true_100k_K16.txt
pgbench (14.8 (Homebrew), server 15.3 (Debian 15.3-1.pgdg120+1))
transaction type: -
scaling factor: 1
query mode: simple
number of clients: 5
number of threads: 5
number of transactions per client: 15
number of transactions actually processed: 75/75
latency average = 15.191 ms
initial connection time = 25.142 ms
tps = 329.152367 (without initial connection time)
statement latencies in milliseconds:
         0.008  \SET id random(1, 10000)
        14.329  SELECT *