jupyter/experiments/sift/outputs/true_10k_K64.txt
pgbench (14.8 (Homebrew), server 15.3 (Debian 15.3-1.pgdg120+1))
transaction type: -
scaling factor: 1
query mode: simple
number of clients: 5
number of threads: 5
number of transactions per client: 15
number of transactions actually processed: 75/75
latency average = 1.761 ms
initial connection time = 14.754 ms
tps = 2839.080895 (without initial connection time)
statement latencies in milliseconds:
         0.005  \SET id random(1, 10000)
         1.680  SELECT *