jupyter/experiments/sift/outputs/true_600k_K8.txt
pgbench (14.8 (Homebrew), server 15.3 (Debian 15.3-1.pgdg120+1))
transaction type: -
scaling factor: 1
query mode: simple
number of clients: 5
number of threads: 5
number of transactions per client: 15
number of transactions actually processed: 75/75
latency average = 38.522 ms
initial connection time = 15.181 ms
tps = 129.795736 (without initial connection time)
statement latencies in milliseconds:
         0.009  \SET id random(1, 10000)
        36.931  SELECT *